Autodesk.Revit.DB.SpatialElementTag.LeaderStartCondition
The leader start condition of the tag, such as if the start of the leader is attached to the tag head or free floating.
Remarks:
Autodesk.Revit.DB.LeaderStartCondition enumerates the supported leader start conditions.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2027

Autodesk.Revit.DB.SpatialElementTag.LeaderStart
The leader start point for tags that use leader start condition Free.
Remarks:
The leader start point is the leader point closest to the tag head.
Use Autodesk.Revit.DB.SpatialElementTag.LeaderStartCondition to get the leader start condition of the tag.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
There is no leader for this tag.
-or-
When setting this property: SpatialElementTag is pinned.
-or-
When setting this property: SpatialElementTag is orphaned.
Since:
2027